nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso55s69/common/pin_mux/cm33_core0/pin_mux.c
- {pin_num: '30', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI_DATA/PLU_OUT3, label: 'P17[3]/P24[6]/FC4_I2C_SDA_ARD', identifier: FC4_I2C_SDA}
- {pin_num: '41', pin_signal: PIO1_22/SD0_CMD/CTIMER2_MAT3/SCT_GPI5/FC4_SSEL3/PLU_OUT4, label: 'P20[4]/PLU_OUT4/GPIO'}
- {pin_num: '42', pin_signal: PIO1_23/FC2_SCK/SCT0_OUT0/SD1_D3/FC3_SSEL2/PLU_OUT5, label: 'P18[8]/PLU_OUT5/GPIO/SD1_D3/FC4_SPI_SSEL2'}
- {pin_num: '3', pin_signal: PIO1_24/FC2_RXD_SDA_MOSI_DATA/SCT0_OUT1/SD1_D1/FC3_SSEL3/PLU_OUT6, label: 'P18[15]/P18[10]/P24[3]/PLU_OUT6/GPIO/FC2_USART_RXD_ARD/SD1_D1'}
- {pin_num: '77', pin_signal: PIO1_25/FC2_TXD_SCL_MISO_WS/SCT0_OUT2/SD1_D0/UTICK_CAP0/PLU_CLKIN, label: 'P18[6]/PLU_CLKIN/GPIO/SD1_D0'}
- {pin_num: '68', pin_signal: PIO1_26/FC2_CTS_SDA_SSEL0/SCT0_OUT3/CT_INP3/UTICK_CAP1/HS_SPI_SSEL3/PLU_IN5, label: 'P18[18]/PLU_IN5/GPIO/SD1_WP'}
- {pin_num: '85', pin_signal: PIO1_27/FC2_RTS_SCL_SSEL1/SD0_D4/CTIMER0_MAT3/CLKOUT/PLU_IN4, label: 'P17[16]/PLU_IN4/GPIO'}
- {pin_num: '73', pin_signal: PIO1_28/FC7_SCK/SD0_D5/CT_INP2/PLU_IN3, label: 'P17[18]/P20[2]/PLU_IN3/GPIO'}
- {pin_num: '80', pin_signal: PIO1_29/FC7_RXD_SDA_MOSI_DATA/SD0_D6/SCT_GPI6/USB1_PORTPWRN/USB1_FRAME/PLU_IN2, label: 'U18[2]/USB1_PORTPWR_N'}
- {pin_num: '65', pin_signal: PIO1_30/FC7_TXD_SCL_MISO_WS/SD0_D7/SCT_GPI7/USB1_OVERCURRENTN/USB1_LEDN/PLU_IN1, label: 'U18[4]/USB1_OVERCURRENT_N'}
- {pin_num: '91', pin_signal: PIO1_31/MCLK/SD1_CLK/CTIMER0_MAT2/SCT0_OUT6/PLU_IN0, label: 'P19[7]/P19[8]/PLU_IN0/GPIO', identifier: MCLK}
- {pin_num: '32', pin_signal: RESETN, label: 'S4/P16[10]/P23[2]/U14[8]/RESETN', identifier: S4}
- {pin_num: '29', pin_signal: XTAL32M_P, label: 'Y3[1]'}
- {pin_num: '28', pin_signal: XTAL32M_N, label: 'Y3[2]'}
- {pin_num: '52', pin_signal: XTAL32K_P, label: 'Y2[1]/XTAL_RTX_P'}
- {pin_num: '53', pin_signal: XTAL32K_N, label: 'Y2[2]/XTAL_RTX_N'}
- {pin_num: '47', pin_signal: VSS_DCDC47, label: GND}
- {pin_num: '46', pin_signal: VSS_DCDC46, label: GND}
- {pin_num: '19', pin_signal: VSSA, label: GND}
- {pin_num: '16', pin_signal: VDDA, label: VDDA_TARGET}
- {pin_num: '100', pin_signal: VDD100, label: 3V3_TRGT_VDDREG}
- {pin_num: '95', pin_signal: VDD95, label: 3V3_TRGT_VDDREG}
- {pin_num: '84', pin_signal: VDD84, label: 3V3_TRGT_VDDREG}
- {pin_num: '75', pin_signal: VDD75, label: 3V3_TRGT_VDDREG}
- {pin_num: '69', pin_signal: VDD69, label: 3V3_TRGT_VDDREG}
- {pin_num: '63', pin_signal: VDD63, label: 3V3_TRGT_VDDREG}
- {pin_num: '44', pin_signal: VDD44, label: 3V3_TRGT_VDDREG}
- {pin_num: '25', pin_signal: VDD25, label: 3V3_TRGT_VDDREG}
- {pin_num: '15', pin_signal: VDD15, label: 3V3_TRGT_VDDREG}
- {pin_num: '51', pin_signal: VBAT_PMU, label: VDDA_TARGET}
- {pin_num: '50', pin_signal: VBAT_DCDC50, label: VDDA_TARGET}
- {pin_num: '49', pin_signal: VBAT_DCDC49, label: VDDA_TARGET}
- {pin_num: '39', pin_signal: VDD_PMU, label: R129}
- {pin_num: '18', pin_signal: VREFN, label: VREFN_TARGET}
- {pin_num: '17', pin_signal: VREFP, label: VREFP_TARGET}
- {pin_num: '36', pin_signal: USB1_VBUS, label: 'P9[1]/USB1_VBUS', identifier: USB1_VBUS}
- {pin_num: '34', pin_signal: USB1_DP, label: 'P9[3]/D9[3]/USB1_HS_P', identifier: USB1_DP}
- {pin_num: '35', pin_signal: USB1_DM, label: 'P9[2]/D9[2]/USB1_HS_N', identifier: USB1_DM}
- {pin_num: '38', pin_signal: USB1_3V3, label: 'P4[3]/VDD_TARGET_3.3'}
- {pin_num: '37', pin_signal: USB1_VSS37, label: GND}
- {pin_num: '33', pin_signal: USB1_VSS33, label: GND}
- {pin_num: '99', pin_signal: USB0_VSS, label: GND}
- {pin_num: '96', pin_signal: USB0_3V3, label: VDD_TARGET_3.3}
- {pin_num: '97', pin_signal: USB0_DP, label: 'P10[3]/D10[3]/USB0_FS_P', identifier: USB0_DP}
- {pin_num: '98', pin_signal: USB0_DM, label: 'P10[2]/D10[2]/USB0_FS_N', identifier: USB0_DM}
- {pin_num: '48', pin_signal: LX, label: GND}
- {pin_num: '45', pin_signal: FB, label: GND}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitPins_Core0();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '92', peripheral: FLEXCOMM0, signal: RXD_SDA_MOSI_DATA, pin_signal: PIO0_29/FC0_RXD_SDA_MOSI_DATA/SD1_D2/CTIMER2_MAT3/SCT0_OUT8/CMP0_OUT/PLU_OUT2/SECURE_GPIO0_29,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '94', peripheral: FLEXCOMM0, signal: TXD_SCL_MISO_WS, pin_signal: PIO0_30/FC0_TXD_SCL_MISO_WS/SD1_D3/CTIMER0_MAT0/SCT0_OUT9/SECURE_GPIO0_30, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    const uint32_t DEBUG_UART_RX = (/* Pin is configured as FC0_RXD_SDA_MOSI_DATA */
                                    IOCON_PIO_FUNC1 |
                                    /* No addition pin function */
                                    IOCON_PIO_MODE_INACT |
                                    /* Standard mode, output slew rate control is enabled */
                                    IOCON_PIO_SLEW_STANDARD |
                                    /* Input function is not inverted */
                                    IOCON_PIO_INV_DI |
                                    /* Enables digital function */
                                    IOCON_PIO_DIGITAL_EN |
                                    /* Open drain is disabled */
                                    IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN29 (coords: 92) is configured as FC0_RXD_SDA_MOSI_DATA */
    IOCON_PinMuxSet(IOCON, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN, DEBUG_UART_RX);

    const uint32_t DEBUG_UART_TX = (/* Pin is configured as FC0_TXD_SCL_MISO_WS */
                                    IOCON_PIO_FUNC1 |
                                    /* No addition pin function */
                                    IOCON_PIO_MODE_INACT |
                                    /* Standard mode, output slew rate control is enabled */
                                    IOCON_PIO_SLEW_STANDARD |
                                    /* Input function is not inverted */
                                    IOCON_PIO_INV_DI |
                                    /* Enables digital function */
                                    IOCON_PIO_DIGITAL_EN |
                                    /* Open drain is disabled */
                                    IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN30 (coords: 94) is configured as FC0_TXD_SCL_MISO_WS */
    IOCON_PinMuxSet(IOCON, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN, DEBUG_UART_TX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWD_DEBUGPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '13', peripheral: SWD, signal: SWCLK, pin_signal: PIO0_11/FC6_RXD_SDA_MOSI_DATA/CTIMER2_MAT2/FREQME_GPIO_CLK_A/SWCLK/SECURE_GPIO0_11/ADC0_9, mode: pullDown,
    slew_rate: standard, invert: disabled, open_drain: disabled, asw: enabled}
  - {pin_num: '12', peripheral: SWD, signal: SWDIO, pin_signal: PIO0_12/FC3_TXD_SCL_MISO_WS/SD1_BACKEND_PWR/FREQME_GPIO_CLK_B/SCT_GPI7/SD0_POW_EN/SWDIO/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_12/ADC0_10,
    mode: pullUp, slew_rate: standard, invert: disabled, open_drain: disabled, asw: enabled}
  - {pin_num: '21', peripheral: SWD, signal: SWO, pin_signal: PIO0_10/FC6_SCK/CT_INP10/CTIMER2_MAT0/FC1_TXD_SCL_MISO_WS/SCT0_OUT2/SWO/SECURE_GPIO0_10/ADC0_1, identifier: DEBUG_SWD_SWO,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled, asw: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

